Autodesk.Revit.UI.DoubleClickTarget
Since:
2016
Elements that support double-click in Revit.  Note that this is meant to cover cases
where the element itself is a double-click target.  Individual controls that are targets
are handled separately.
Since:
2016

Autodesk.Revit.UI.DoubleClickTarget.OutsideViewOnSheet
Outside active view on sheet

Autodesk.Revit.UI.DoubleClickTarget.ComponentStairs
Component-based stairs

Autodesk.Revit.UI.DoubleClickTarget.Group
Groups

Autodesk.Revit.UI.DoubleClickTarget.Assembly
Assemblies

Autodesk.Revit.UI.DoubleClickTarget.ViewOnSheet
Views on sheets

Autodesk.Revit.UI.DoubleClickTarget.SketchedElement
Sketch-based elements

Autodesk.Revit.UI.DoubleClickTarget.Family
Family instances